MMartysh/Stm32f429_uart_terminal/pwm.c
#include "stm32f4xx_hal.h"
#include "errorHandlers.h"
#include "pwm.h"

//pwm handler

TIM_HandleTypeDef htim1;

/**
* @brief  TIM Output Compare Configuration Structure
*/

TIM_OC_InitTypeDef sConfigOC = {0};


 /* ----------------------------------------------------------------------------
 */
/*!
 @brief         Initializes clocks for GPIO ports and sets up settings for PC1 pin

 @param         None.

 @return        None. 
*/
/* ----------------------------------------------------------------------------
 */
void TIM1_Init(void)
{
  TIM_ClockConfigTypeDef sClockSourceConfig = {0};
  TIM_MasterConfigTypeDef sMasterConfig = {0};
  TIM_BreakDeadTimeConfigTypeDef sBreakDeadTimeConfig = {0};
  htim1.Instance = TIM1;
  htim1.Init.Prescaler = 16;
  htim1.Init.CounterMode = TIM_COUNTERMODE_UP;
  htim1.Init.Period = 100;
  htim1.Init.ClockDivision = TIM_CLOCKDIVISION_DIV1;
  htim1.Init.RepetitionCounter = 0;
  htim1.Init.AutoReloadPreload = TIM_AUTORELOAD_PRELOAD_DISABLE;
  if (HAL_TIM_Base_Init(&htim1) != HAL_OK)
  {
    Error_Handler();
  }
  sClockSourceConfig.ClockSource = TIM_CLOCKSOURCE_INTERNAL;
  if (HAL_TIM_ConfigClockSource(&htim1, &sClockSourceConfig) != HAL_OK)
  {
    Error_Handler();
  }
  if (HAL_TIM_PWM_Init(&htim1) != HAL_OK)
  {
    Error_Handler();
  }
  sMasterConfig.MasterOutputTrigger = TIM_TRGO_RESET;
  sMasterConfig.MasterSlaveMode = TIM_MASTERSLAVEMODE_DISABLE;
  if (HAL_TIMEx_MasterConfigSynchronization(&htim1, &sMasterConfig) != HAL_OK)
  {
    Error_Handler();
  }
  sConfigOC.OCMode = TIM_OCMODE_PWM1;
  sConfigOC.Pulse = 99;
  sConfigOC.OCPolarity = TIM_OCPOLARITY_HIGH;
  sConfigOC.OCNPolarity = TIM_OCNPOLARITY_HIGH;
  sConfigOC.OCFastMode = TIM_OCFAST_DISABLE;
  sConfigOC.OCIdleState = TIM_OCIDLESTATE_RESET;
  sConfigOC.OCNIdleState = TIM_OCNIDLESTATE_RESET;
  if (HAL_TIM_PWM_ConfigChannel(&htim1, &sConfigOC, TIM_CHANNEL_1) != HAL_OK)
  {
    Error_Handler();
  }
  sBreakDeadTimeConfig.OffStateRunMode = TIM_OSSR_DISABLE;
  sBreakDeadTimeConfig.OffStateIDLEMode = TIM_OSSI_DISABLE;
  sBreakDeadTimeConfig.LockLevel = TIM_LOCKLEVEL_OFF;
  sBreakDeadTimeConfig.DeadTime = 0;
  sBreakDeadTimeConfig.BreakState = TIM_BREAK_DISABLE;
  sBreakDeadTimeConfig.BreakPolarity = TIM_BREAKPOLARITY_HIGH;
  sBreakDeadTimeConfig.AutomaticOutput = TIM_AUTOMATICOUTPUT_DISABLE;
  if (HAL_TIMEx_ConfigBreakDeadTime(&htim1, &sBreakDeadTimeConfig) != HAL_OK)
  {
    Error_Handler();
  }
  HAL_TIM_MspPostInit(&htim1);

}

 /* ----------------------------------------------------------------------------
 */
/*!
 @brief         Starts PWM on Channel 1 with given duty cycle

 @param[in]     p_ui_DutyCycle PWM duty cycle in percents 

 @return        None. 
*/
/* ----------------------------------------------------------------------------
 */
void PWM_Start(uint32_t p_ui_DutyCycle)
{
	HAL_TIM_PWM_Start(&htim1, TIM_CHANNEL_1);
	htim1.Instance->CCR1 = p_ui_DutyCycle;
}

/* ----------------------------------------------------------------------------
 */
/*!
 @brief         Stops PWM on Channel 1 

 @param         None.

 @return        None. 
*/
/* ----------------------------------------------------------------------------
 */
void PWM_Stop(void)
{
	HAL_TIM_PWM_Stop(&htim1, TIM_CHANNEL_1);
}


